glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/main.c
// ============================================================================
// register_dongle — Seeed XIAO RA4M1 (Renesas R7FA4M1AB, Cortex-M4)
// Step 3b — port of the SAMD21 register_dongle:
//   * s_engine M-port            (proven on RA4M1 by blink_engine)
//   * libcomm SLIP+CRC framing   (proven on RA4M1 by blink_frame)
//   * register_dongle_v2 chain   (Linux waypoint, state machine + dispatch)
//
// Chain shape (v2; locked 2026-05-13 — see register_dongle_v2.lua):
//   io_call(send_register) once on first INIT
//   se_state_machine("dongle_state", {
//     BOOT case:        event_dispatch{ OP_REGISTER_ACK -> set state=OPERATIONAL }
//     OPERATIONAL case: se_fork(
//                         chain_flow{ o_call(send_heartbeat); tick_delay(3); reset },
//                         m_call(toggle_led),
//                         event_dispatch{ OP_PING -> o_call(send_pong) }
//                       )
//   })
//   se_return_halt()
//
// One USB-CDC port. s2m frames staged in the shared TX ring; main loop drains
// to CDC each iteration. RX path: tud_cdc_read -> frame_decoder_feed -> on
// FRAME_READY, s_expr_event_push(tree, SE_EVENT_TICK, meta.cmd, NULL). After
// every engine tick the main loop drains the event_queue, ticking the tree
// once per popped event so se_event_dispatch handlers fire.
//
// RA4M1-specific vs the SAMD21 reference: firmware_get_sysinfo (linker symbols
// + totals), the 1200-baud-touch DFU handler, and the chip header. The RX/TX
// path, the engine tick/drain, and host-reattach detection are chip-agnostic.
// ============================================================================

#include <stdint.h>
#include <stddef.h>
#include <stdbool.h>
#include <string.h>

#include "bsp/board_api.h"
#include "tusb.h"
#include "bsp_api.h"    // FSP/CMSIS: NVIC_SystemReset, SystemCoreClock

#include "s_engine_types.h"
#include "s_engine_module.h"
#include "s_engine_node.h"
#include "s_engine_rom.h"
#include "s_engine_event_queue.h"

#include "register_dongle_v2.h"

#include "frame.h"
#include "opcodes.h"
#include "flash_storage.h"
#include "shell_commands.h"  // firmware_sysinfo_t
#include "mode.h"            // multi-mode foundation (VTOR reloc + mode table)
#include "ra4m1_hal.h"       // HIL peripheral drivers
#include "control.h"         // motor-control core (Tier1/PendSV/two-slot motor)
#include "ra4m1_rs485.h"     // SCI2 RS-485 transport (ROLE_SLAVE)

// Implemented in user_functions.c.
extern void     register_dongle_load_commissioning(void);
extern uint32_t g_pending_commission_instance_id;
extern bool     shell_pending_push(const uint8_t* payload, uint8_t len);
extern uint8_t  register_dongle_rs485_addr(void);
extern uint16_t shell_dispatch_payload(const uint8_t* exec, uint16_t exec_len,
                                       uint8_t* reply);
extern void     workbench_analog_poll(void);   // ra4m1_commands.c — ADC sampler
extern void     spectral_pump(void);            // spectral.c — mode-2 FFT pump
extern void     goertzel_pump(void);            // goertzel.c — mode-4 block finalize

// ----------------------------------------------------------------------------
// Deferred-reboot plumbing. Two flavors:
//   * firmware_request_reboot()     — plain reset; the app relaunches. Used by
//     the L0 commissioning handlers (OP_COMMISSION_SET / CLEAR).
//   * firmware_request_dfu_reboot() — reset INTO the Seeed DFU bootloader so
//     `dfu-util` can reflash. Triggered by the 1200-baud touch (see
//     tud_cdc_line_coding_cb).
// Either way the main loop waits for TX to drain (~200 ms) before resetting,
// so the OP_COMMISSION_REPLY frame and any in-flight bytes reach the host.
//
// DFU entry: a plain NVIC_SystemReset() just relaunches the app — the Seeed
// bootloader needs a "stay in DFU" magic written to a known RAM location it
// checks after reset.
//
// TODO-verify (Pi): the magic value + RAM address the XIAO RA4M1 Seeed/Arduino
// bootloader checks. The values below are PLACEHOLDERS (the address is the top
// of the 32 KB SRAM; the value is the SAMD21 Arduino magic). Read the real
// values off the Seeed XIAO RA4M1 bootloader source, or confirm empirically.
// Until corrected, the 1200-baud touch resets but relaunches the app — flash
// via the BOOT-button + raflash route in the meantime. See README.md.
// ----------------------------------------------------------------------------
#define DFU_DOUBLE_TAP_ADDR   0x20007FF8U   // PLACEHOLDER — top of RA4M1 SRAM
#define DFU_DOUBLE_TAP_MAGIC  0x07738135U   // PLACEHOLDER — SAMD21 Arduino value

static volatile uint32_t g_reboot_at_ms  = 0;     // 0 = no reboot pending
static volatile bool     g_reboot_to_dfu = false;

void firmware_request_reboot(uint32_t delay_ms) {
    g_reboot_to_dfu = false;
    g_reboot_at_ms  = board_millis() + delay_ms;
    if (g_reboot_at_ms == 0) g_reboot_at_ms = 1;   // 0 reserved as sentinel
}

void firmware_request_dfu_reboot(void) {
    g_reboot_to_dfu = true;
    g_reboot_at_ms  = board_millis() + 50u;        // brief settle before reset
    if (g_reboot_at_ms == 0) g_reboot_at_ms = 1;
}

// ----------------------------------------------------------------------------
// tud_cdc_line_coding_cb — TinyUSB calls this whenever the host sets the CDC
// line coding. The 1200-baud "touch" is the Arduino convention for "reset
// into the bootloader to be reflashed": `stty -F /dev/ttyACM0 1200`. No normal
// host tool opens the port at 1200 bps, so it is a safe sentinel.
// ----------------------------------------------------------------------------
void tud_cdc_line_coding_cb(uint8_t itf, cdc_line_coding_t const* coding) {
    (void)itf;
    if (coding != NULL && coding->bit_rate == 1200) {
        firmware_request_dfu_reboot();
    }
}

extern const s_engine_rom_t register_dongle_v2_module_rom;

// ----------------------------------------------------------------------------
// Bump allocator.
// Linux v2 chain peak: 520 B with one tree active. Cortex-M4 alignment is
// similar; 768 B leaves comfortable headroom for the larger op state machine.
// ----------------------------------------------------------------------------

#define BUMP_BUFFER_SIZE 768u

static uint8_t  g_bump_buffer[BUMP_BUFFER_SIZE] __attribute__((aligned(8)));
static size_t   g_bump_used = 0;
static size_t   g_bump_peak = 0;

static void* bump_malloc(void* ctx, size_t size) {
    (void)ctx;
    size_t aligned = (size + 7u) & ~(size_t)7u;
    if (g_bump_used + aligned > BUMP_BUFFER_SIZE) {
        return NULL;
    }
    void* p = &g_bump_buffer[g_bump_used];
    g_bump_used += aligned;
    if (g_bump_used > g_bump_peak) g_bump_peak = g_bump_used;
    return p;
}

static void bump_free(void* ctx, void* ptr) {
    (void)ctx; (void)ptr;
}

// ----------------------------------------------------------------------------
// firmware_get_sysinfo — RA4M1 (R7FA4M1AB) implementation. Called by the
// CMD_SYSINFO shell handler. Linker symbols come from the FSP GCC linker
// script; the application is linked at flash 0x4000 (the low 16 KB is the
// Seeed DFU bootloader — see the RA4M1 bring-up memory).
//
// TODO-verify (Pi): the FSP linker-script symbol names below. The names used
// are the CMSIS/GCC-standard ones FSP's fsp.ld is expected to export; confirm
// against the vendored linker script and adjust if they differ. See README.md.
// ----------------------------------------------------------------------------
extern char __etext[];          // end of text+rodata in flash (.data init src)
extern char __data_start__[];   // start of .data in RAM
extern char __data_end__[];     // end   of .data in RAM
extern char __bss_start__[];    // start of .bss in RAM
extern char __bss_end__[];      // end   of .bss in RAM
extern char __StackTop[];       // top of stack
extern char __StackLimit[];     // bottom of stack region

#define RA4M1_FLASH_TOTAL_KB   256u
#define RA4M1_RAM_TOTAL_KB     32u
#define RA4M1_APP_FLASH_ORIGIN 0x4000u

