glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/main.c
#if defined(ROLE_SLAVE)
// ----------------------------------------------------------------------------
// RS-485 slave, ISR-driven response (ported from the SAMD21 register_dongle).
// The RXI handler assembles each frame addressed to us and dispatches it via
// slave_rx_isr (IN ISR CONTEXT):
//   * POLL -> if a command reply is armed, ship it on this window (frees BUSY);
//             else NO_MESSAGE carrying a summary byte (always 0 — the RA4M1 has
//             no interlock framework, unlike the SAMD21's two-buffer model).
//   * DATA -> ACK + claim the one-in-flight slot (or NAK if already BUSY). The
//             ACK frees the bus the instant it shifts out, so a slow command
//             runs entirely off the bus.
// The main loop (rs485_slave_poll) executes a claimed command through the SAME
// shell layer used over USB (shell_dispatch_payload) and arms the reply, which
// the ISR emits on the next poll. A BUSY-watchdog frees a slot whose command
// overran exec_timeout+margin (wedged command, or a master that vanished).
// ----------------------------------------------------------------------------
#define RS485_SHELL_EXEC_HEADER_LEN 4u     // request_id u16 + command_id u16
#define SLAVE_ABORT_MARGIN_MS       1000u  // BUSY-watchdog slack over exec_timeout

static volatile uint8_t g_slave_summary;        // NO_MESSAGE summary byte (0 here)

static volatile bool     g_slave_busy;          // claimed a command; held until reply ships
static volatile bool     g_slave_work_fresh;    // a claimed command awaits main-loop execution
static rs485_frame_t     g_slave_in;            // ISR -> main loop (the claimed command)
static volatile bool     g_slave_reply_ready;   // main loop armed a reply; ISR emits on a poll
static uint32_t          g_slave_claim_ms;      // when the in-flight command was picked up
static uint16_t          g_slave_exec_to;       // its exec_timeout (0 = watchdog disabled)

static uint8_t g_slave_reply[RS485_PAYLOAD_MAX]; // [OP_SHELL_REPLY:u16][req_id][status][result]
static uint8_t g_slave_reply_len;

// Locate the shell-exec body inside a bus DATA command + extract exec_timeout.
// Returns the header length (offset to [req_id][cmd][args]), or 0 if not a command.
static uint8_t slave_cmd_parse(const rs485_frame_t* f, uint16_t* exec_timeout_ms) {
    if (f->len < 2u) return 0u;
    uint16_t opcode = (uint16_t)f->payload[0] | ((uint16_t)f->payload[1] << 8);
    if (opcode == OP_BUS_EXEC) {
        if (f->len < (uint8_t)(4u + RS485_SHELL_EXEC_HEADER_LEN)) return 0u;
        *exec_timeout_ms = (uint16_t)f->payload[2] | ((uint16_t)f->payload[3] << 8);
        return 4u;   // opcode(2) + exec_timeout(2)
    }
    if (opcode == OP_SHELL_EXEC) {
        if (f->len < (uint8_t)(2u + RS485_SHELL_EXEC_HEADER_LEN)) return 0u;
        *exec_timeout_ms = 0u;
        return 2u;   // opcode(2)
    }
    return 0u;
}

// ISR context.
static void slave_rx_isr(const rs485_frame_t* f) {
    uint8_t cls = (uint8_t)(f->type & RS485_FT_MASK);
    if (cls == RS485_FT_POLL) {
        if (g_slave_reply_ready) {
            if (rs485_tx_async_start(RS485_ADDR_MASTER, register_dongle_rs485_addr(),
                                     RS485_FT_DATA, f->seq,
                                     g_slave_reply, g_slave_reply_len)) {
                g_slave_reply_ready = false;
                g_slave_busy        = false;   // done; ready for the next command
            }
            // TX busy this round -> retry on the next poll (reply stays armed).
        } else {
            rs485_tx_async_start(RS485_ADDR_MASTER, register_dongle_rs485_addr(),
                                 RS485_FT_NO_MESSAGE, f->seq,
                                 (const uint8_t*)&g_slave_summary, 1);
        }
    } else if (cls == RS485_FT_DATA) {
        uint16_t to;
        uint8_t hdr = slave_cmd_parse(f, &to);
        if (hdr == 0u) return;                                 // not a recognised command
        uint8_t rid[2] = { f->payload[hdr], f->payload[hdr + 1u] };
        if (!g_slave_busy) {
            g_slave_in         = *f;
            g_slave_busy       = true;
            g_slave_work_fresh = true;
            rs485_tx_async_start(RS485_ADDR_MASTER, register_dongle_rs485_addr(),
                                 RS485_FT_ACK, f->seq, rid, 2);
        } else {
            rs485_tx_async_start(RS485_ADDR_MASTER, register_dongle_rs485_addr(),
                                 RS485_FT_NAK, f->seq, rid, 2);
        }
    }
}

// Main loop: BUSY-watchdog, then execute a claimed command and arm its reply for
// the ISR to ship on the next poll. Does NOT transmit (the ISR owns the wire).
static void rs485_slave_poll(void) {
    // BUSY-watchdog: a claimed command that overruns exec_timeout+margin (or whose
    // reply never ships because the master vanished) frees the slot.
    if (g_slave_busy && g_slave_exec_to > 0u &&
        (uint32_t)(board_millis() - g_slave_claim_ms) >
            (uint32_t)g_slave_exec_to + SLAVE_ABORT_MARGIN_MS) {
        g_slave_busy        = false;
        g_slave_work_fresh  = false;
        g_slave_reply_ready = false;
        g_slave_exec_to     = 0u;
    }

    if (!g_slave_work_fresh) return;
    g_slave_work_fresh = false;
    rs485_frame_t f = g_slave_in;      // stable while BUSY (ISR won't reclaim until reply ships)

    uint16_t to;
    uint8_t hdr = slave_cmd_parse(&f, &to);
    if (hdr == 0u) { g_slave_busy = false; return; }   // malformed (ISR already filtered)
    g_slave_claim_ms = board_millis();
    g_slave_exec_to  = to;
    const uint8_t* exec     = &f.payload[hdr];
    uint16_t       exec_len = (uint16_t)(f.len - hdr);

    uint8_t  reply_body[COMM_PAYLOAD_MAX];
    uint16_t reply_len = shell_dispatch_payload(exec, exec_len, reply_body);
    if (reply_len > (uint16_t)(RS485_PAYLOAD_MAX - 2u)) reply_len = RS485_PAYLOAD_MAX - 2u;
    g_slave_reply[0] = (uint8_t)(OP_SHELL_REPLY & 0xFFu);
    g_slave_reply[1] = (uint8_t)(OP_SHELL_REPLY >> 8);
    for (uint16_t i = 0; i < reply_len; i++) g_slave_reply[2u + i] = reply_body[i];
    g_slave_reply_len   = (uint8_t)(2u + reply_len);
    g_slave_reply_ready = true;        // ISR ships it on the next poll
}
#endif  // ROLE_SLAVE

// ----------------------------------------------------------------------------
// Entry
// ----------------------------------------------------------------------------

int main(void) {
    stack_paint();              // paint unused stack for the HWM scan — do first
    board_init();

    tusb_rhport_init_t const rhport_init = {
        .role  = TUSB_ROLE_DEVICE,
        .speed = TUSB_SPEED_AUTO,
    };
    tusb_init(BOARD_TUD_RHPORT, &rhport_init);

    // Multi-mode foundation: relocate the vector table to RAM (so mode
    // dispatcher handlers can be installed), prepare the mode periodic timer,
    // and enter MODE_WORKBENCH. After tusb_init() so the live USB vector
    // entries are captured into the relocated table.
    mode_init();

    // Motor-control core: install the 20 kHz sample ISR into the (now relocated)
    // vector table, set the PendSV priority, park the H-bridge safe, bring up the
    // encoder, and enter MOTOR_IDLE. Runs as the "motor slot" alongside the
    // mode.c DSP slot. After mode_init() (needs the RAM vector table).
    control_init();

