glenn-edgar/motioncore-prototype/ra4m1/apps/register_dongle/src/main.c
    frame_ring_init(&g_tx_ring, g_tx_ring_buf, TX_RING_SIZE);
    frame_decoder_init(&g_rx_decoder, FRAME_DIR_M2S);

    // L0: read commissioning blob from data flash before engine starts.
    // Factory-fresh dongles read nothing; defaults to UNCOMMISSIONED.
    register_dongle_load_commissioning();

#if defined(ROLE_SLAVE)
    // RS-485 slave transport. rs485_init installs ISR handlers into the relocated
    // RAM vector table, so it must run after mode_init(). Address = low byte of
    // the commissioned instance_id (0 if uncommissioned), so after commissioning
    // is loaded. flags=0: no self-echo discard on bare-TTL / 4-wire xcvr.
    rs485_init();
    rs485_config(0, register_dongle_rs485_addr(), 0);
    rs485_set_isr_dispatch(slave_rx_isr);   // answer POLLs straight from the RXI ISR
#endif

    s_expr_allocator_t alloc = {
        .malloc      = bump_malloc,
        .free        = bump_free,
        .ctx         = NULL,
        .get_time    = NULL,    // skip double-precision path; see comment above
        .get_time_ms = engine_get_time_ms,
    };

    s_expr_module_t module;
    s_expr_tree_instance_t* tree = NULL;
    uint8_t init_err = s_engine_init_rom(&module, &register_dongle_v2_module_rom, alloc);
    (void)init_err;
    if (init_err == S_EXPR_ERR_OK) {
        s_expr_module_set_debug(&module, debug_packet_fn);
        tree = s_expr_tree_create_by_hash(&module, REGISTER_DONGLE_V2_HASH, 0);
    }

    // Engine tick cadence: 250 ms (chain expects 4 ticks/sec).
    //
    // Cold-boot OP_REGISTER delivery: Phase 2f moved emission to a retry
    // loop in the BOOT state's chain. Re-fires every ~1 sec until
    // OP_REGISTER_ACK arrives, so host attach timing doesn't matter.
    uint32_t next_tick_ms = 250;

    // Host-reattach detection: poll tud_cdc_connected() (DTR line state).
    // On false->true edge after a prior true->false drop, push
    // EV_HOST_REATTACH to the engine event queue. The chain's
    // handle_internal_events user fn responds by writing dongle_state =
    // BOOT, which se_state_machine sees on its tick within the same drain.
    // Polling (not the tud_cdc_line_state_cb callback) keeps it
    // race-free single-producer for the event queue.
    bool prev_cdc_connected = false;
    bool saw_disconnect     = false;

    for (;;) {
        tud_task();

        // Workbench analog collection — self-gated ~1 kHz ADC sampler. No-op
        // unless ANALOG_START is active; runs in this main-loop context so it
        // never delays the DAC-waveform / PWM-dither ISRs.
        workbench_analog_poll();

        // Mode-2 spectral pump — picks up filled ADC capture buffers, runs
        // window + rfft + |X[k]|² accumulation. No-op unless SPECTRAL is the
        // active mode AND a frame has finished capturing. Foreground context
        // so the FFT does not preempt the sample-tick ISR.
        spectral_pump();
        goertzel_pump();

        // Tier-0 motor-control housekeeping (pseudo-interlock event delivery
        // lands here with MODE_SCURVE). No-op for IDLE / MANUAL.
        control_service();

#if defined(ROLE_SLAVE)
        // RS-485 slave: execute any claimed command off the bus and arm its
        // reply for the RXI ISR to ship on the next poll. No-op when idle.
        rs485_slave_poll();
#endif

        // Host-reattach edge detection.
        if (tree != NULL) {
            bool now_connected = tud_cdc_connected();
            if (!now_connected && prev_cdc_connected) {
                saw_disconnect = true;
                // DIAG: log the drop event so we can see DTR transitions.
                if (module.debug_fn) module.debug_fn(NULL, "[CDC] DTR dropped");
            } else if (now_connected && !prev_cdc_connected) {
                if (saw_disconnect) {
                    saw_disconnect = false;
                    s_expr_event_push(tree, SE_EVENT_TICK, EV_HOST_REATTACH, NULL);
                    if (module.debug_fn) module.debug_fn(NULL, "[CDC] DTR up after drop -> EV_HOST_REATTACH");
                } else {
                    if (module.debug_fn) module.debug_fn(NULL, "[CDC] DTR up (first attach)");
                }
            }
            prev_cdc_connected = now_connected;
        }

        // Always drain RX, even between ticks — events accumulate in the
        // tree's queue and are dispatched at the next tick_and_drain().
        if (tree != NULL) {
            rx_drain_to_event_queue(tree);
        }

        uint32_t now = board_millis();
        if (tree != NULL && (int32_t)(now - next_tick_ms) >= 0) {
            next_tick_ms += 250;
            tick_and_drain(tree);
        }

        // Drain a chunk of the TX ring to CDC every loop. CFG_TUD_CDC_TX_BUFSIZE
        // is 64 B; sizing buf to 64 B keeps each drain within one write.
        if (tud_cdc_connected()) {
            uint8_t buf[64];
            uint32_t n = frame_ring_read_drain(&g_tx_ring, buf, sizeof(buf));
            if (n > 0) {
                tud_cdc_write(buf, n);
                tud_cdc_write_flush();
            }
        }

        // Deferred reboot. Wait until the requested time has passed AND the
        // TX ring is empty so the OP_COMMISSION_REPLY frame (and any logs)
        // actually leave the dongle before USB renegotiates.
        if (g_reboot_at_ms != 0 && (int32_t)(board_millis() - g_reboot_at_ms) >= 0) {
            tud_cdc_write_flush();
            if (g_reboot_to_dfu) {
                // Signal the Seeed bootloader to stay in DFU after this reset.
                // PLACEHOLDER constants — see the TODO-verify note at the top.
                *(volatile uint32_t*)DFU_DOUBLE_TAP_ADDR = DFU_DOUBLE_TAP_MAGIC;
            }
            NVIC_SystemReset();
            // not reached
        }
    }
}
